In [2]:
import pandas as pd

In [3]:
a=pd.Series([1000,1400,4000,5000,10000,3000,3000,30000])

In [4]:
df=pd.DataFrame({"Salary":a})

In [24]:
df

   Name   Age
0  Hari  12.0
1  Sita   NaN
2  Rita   NaN
3  Gita   NaN

In [25]:
df.to_csv("friend.csv")

In [5]:
print("min:",min(df["Salary"]))
print("max:",max(df["Salary"]))

min: 1000
max: 30000

In [7]:
def normalize(df):
    data=df["Salary"]
    #setting
    df["Salary"]=[round((i-min(data))/(max(data)-min(data)),2)for i in data]
    return df
print(normalize(df))

   Salary
0    0.00
1    0.01
2    0.10
3    0.14
4    0.31
5    0.07
6    0.07
7    1.00

#Handling missing value

In [9]:
Name=pd.Series(["Hari","Sita","Rita","Gita"])
Age=pd.Series([21,23])

In [10]:
df=pd.DataFrame({"Name":Name,"Age":Age})
df

   Name   Age
0  Hari  21.0
1  Sita  23.0
2  Rita   NaN
3  Gita   NaN

In [11]:
df.isna().sum() #important function of pandas

Name    0
Age     2
dtype: int64

In [12]:
df.fillna(0)

   Name   Age
0  Hari  21.0
1  Sita  23.0
2  Rita   0.0
3  Gita   0.0

In [13]:
df

   Name   Age
0  Hari  21.0
1  Sita  23.0
2  Rita   NaN
3  Gita   NaN

In [14]:
df.fillna(0,inplace=True)

In [16]:
df

   Name   Age
0  Hari  21.0
1  Sita  23.0
2  Rita   0.0
3  Gita   0.0

In [17]:
df.isna().sum()

Name    0
Age     0
dtype: int64

In [18]:
import numpy as np
df["Age"]=[12,np.nan,np.nan,np.nan]

In [19]:
df

   Name   Age
0  Hari  12.0
1  Sita   NaN
2  Rita   NaN
3  Gita   NaN

In [21]:
df.dropna(how="all")  #any all

   Name   Age
0  Hari  12.0
1  Sita   NaN
2  Rita   NaN
3  Gita   NaN

In [23]:
df.replace(np.nan,value=10.1)

   Name   Age
0  Hari  12.0
1  Sita  10.1
2  Rita  10.1
3  Gita  10.1